/**
 * @file adapter_platform.c
 * @brief 平台适配操作接口
 *
 * @copyright Copyright(C),2018-2020, 涂鸦科技 www.tuya.com
 *
 */

#define _ADAPTER_PLATFORM_GLOBAL
#include "tuya_os_adapter.h"
#include "tuya_os_adapter_error_code.h"

#ifdef __cplusplus
extern "C" {
#endif


/***********************************************************
*************************micro define***********************
***********************************************************/


/***********************************************************
*************************variable define********************
***********************************************************/

/***********************************************************
*************************function define********************
***********************************************************/
/***********************************************************
*  Function: adapter_platform_init
*  Input: none
*  Output: none
*  Return: OPERATE_RET
***********************************************************/
int tuya_os_adapter_init(void)
{
    return 0;
}

